{
    "0": {
        "steps": [
            "Heat the Coconut Oil in a wide pan over a medium flame, then add the Onion, Garlic, Scallion, and Ground Black Pepper. Reduce the heat to low for about 3-4 minutes.",
            "Add the Small Shrimp, stir well and cook for another 3 minutes.",
            "Turn the heat up to medium high and add the Jamaican Callaloo, Tomato, Scotch Bonnet Pepper, Fresh Thyme, and Sea Salt. After a couple minutes, add the Water and cook until tender.",
            "After about 10-12 minutes, taste for salt and adjust accordingly.",
            "",
            ""
        ],
        "steps_generated": [
            "a pan with coconut oil, onions, garlic, scallions, and ground black pepper in it",
            "the person is stirring the shrimp in a pan with a wooden spoon",
            "a person is adding ingredients to a pan on a stove top",
            "a person is stirring a pot of soup on a stove top",
            "",
            ""
        ],
        "goal": "Jamaican Callaloo With Shrimp"
    },
    "2": {
        "steps": [
            "To a medium bowl, add Pecans, Vegan Cream Cheese, Daiya® Mozzarella Cheese, Sun-Dried Tomatoes in Olive Oil, Garlic, Ground Black Pepper, and Vegan Basil Pesto. Stir until well combined.",
            "Add Fresh Spinach to the mixture and continue stirring until all ingredients are well mixed.",
            "Lay out Tortilla, divide cheese/pesto/tomato mixture evenly among the four tortillas, spreading in a thin layer until it coats the whole tortilla up to the outer edge. Tear and sprinkle approximately 5 Fresh Basil Leaf over each tortilla.",
            "Gently roll tortillas, keeping them fairly tight, then slice each into 8 pieces. Serve immediately or store in the refrigerator for up to 3 days.",
            "",
            ""
        ],
        "steps_generated": [
            "a bowl of ingredients including pecans, vegan cream cheese, dairy mozzarella cheese, sun-dried tomatoes in olive oil, garlic, ground black pepper, and vegan basil pesto",
            "a bowl of spinach and cheese mixture sits on a wooden table",
            "A person is spreading cheese and pesto on a tortilla with a knife",
            "A person is rolling a tortilla on a cutting board with a rolling pin. They are then slicing the tortilla into 8 pieces and serving them on a plate",
            "",
            ""
        ],
        "goal": "Vegan Basil Pesto and Sun-Dried Tomato Pinwheels"
    },
    "3": {
        "steps": [
            "Melt butter in a small pot over medium heat.",
            "Add egg and sugar to a bowl and whisk until combined. Stir in honey and add lemon zest. Stir to combine until a smooth batter forms.",
            "Sieve flour and baking powder into the batter, then add melted butter and stir to combine. Cover bowl with plastic wrap and let rest in the fridge for at least 3 hrs.",
            "Pre-heat oven to 210°C/410°F. Grease baking pan with butter. Remove batter from the fridge and transfer into a piping bag. Cut off the tip and pipe batter into baking pan up to three quarters, so the madeleines have enough space to rise.",
            "Reduce baking temperature to 170°C/350°F and bake madeleines for approx. 12 – 15 min. until golden brown. Dust with confectioner’s sugar and",
            ""
        ],
        "steps_generated": [
            "a small pot with butter in it on the stove",
            "a person is stirring a bowl of ingredients with a spoon",
            "A person is stirring a bowl of ingredients with a spoon",
            "A person is piping batter into a baking pan with a piping bag",
            "A person is baking madeleines in an oven at 170°C/350°F",
            ""
        ],
        "goal": "Madeleines"
    },
    "4": {
        "steps": [
            "Preheat oven to 180°C/350°F and grease springform pan with coconut oil. For the crust, pulse oats in a food processor to a fine flour. Add buckwheat flour, coconut oil, maple syrup, some cinnamon, baking powder, and a pinch of salt, and pulse to form a crust. If the mixture is too dry, carefully add water a tbsp. at a time to make the crust moldable.",
            "Use hands to press two-thirds of the dough evenly into springform pan along the base and border. Lightly flour work surface and remaining dough. Roll out, using a rolling pin. Use a cookie cutter to cut out decorative shapes, or roll out dough into a round the size of the pan, if you prefer.",
            "For the filling, peel and quarter apples. Remove core and slice.",
            "In a large bowl, thoroughly mix apple slices, some cinnamon, nutmeg, lemon juice, agave syrup, arrowroot flour, coconut sugar, speculaas spice, and salt.",
            "Transfer filling to prepared springform pan and spread evenly.",
            "Cover filling with either with cookie cut-outs or a round of dough. For the latter, pierce top with a fork to allow steam to escape while baking. Place in preheated oven and bake at 180°C/350°F for approx. 30 min. Cover with aluminum foil and press down lightly so that the apple juice rises to the top and soaks the entire cake. Bake for approx. 45 – 60 min. more, until golden brown. Allow to cool completely on a cooling rack before cutting."
        ],
        "steps_generated": [
            "A person is using a food processor to make a crust for a cake in a springform pan",
            "A person is using a rolling pin to roll out dough on a wooden table",
            "the person is slicing apples on a cutting board with a knife",
            "a person is stirring a large bowl of apple slices, cinnamon, nutmeg, lemon juice, agave syrup, arrowroot flour, coconut sugar, speculaas spice, and salt",
            "the person is spreading a layer of filling on a springform pan",
            "A person is using a fork to pierce the top of a cake before baking it in an oven at 180°C/350°F for about 30 minutes. They then cover the cake with aluminum foil and press down lightly so that the apple juice rises to the top and soaks the entire"
        ],
        "goal": "Gluten-free apple cake"
    },
    "7": {
        "steps": [
            "Preheat oven to 200°C/400°F. Pierce skin of sweet potatoes approx. 5 to 7 times with a fork. Then, place on a parchment-lined baking sheet, transfer to oven, and bake at 200°C/400°F for approx. 45 – 60 min. Once baking time is finished, turn off oven and leave potatoes in oven until the other steps are complete.",
            "Mince garlic. Cut lemon into wedges and halve pomegranate. Remove seeds from pomegranate.",
            "In a large, grease-free frying pan, toast pine nuts over medium heat for approx. 1 –2 min. until fragrant and golden brown. Remove from pan and set aside.",
            "Add some of the coconut oil to pan, sauté garlic, and wilt spinach over medium heat for approx. 1 – 2 min. Drizzle with part of the lemon juice. Add toasted pine nuts to spinach and set aside.",
            "Remove potatoes from oven and cut in half. Add rest of coconut oil to potato halves and mash with fork.",
            "Spoon spinach and pine nut mixture on top of potatoes. Add some more lemon juice. Drizzle with yogurt on top and garnish with pomegranate seeds. Season with salt and pepper to taste."
        ],
        "steps_generated": [
            "A woman is cooking sweet potatoes in an oven at 200°C/400°F",
            "a person is mincing garlic on a cutting board with a knife",
            "In a large, grease-free frying pan, toast pine nuts over medium heat for approx. 1 –2 min. until fragrant and golden brown. Remove from pan and set aside",
            "A person is cooking spinach in a pan with garlic and pine nuts",
            "a person is cutting potatoes in half and adding coconut oil to them before mashing them with a fork",
            "a person is putting spinach and pine nut mixture on top of potatoes"
        ],
        "goal": "Baked sweet potatoes with spinach and pine nuts"
    },
    "8": {
        "steps": [
            "Place eggs and egg white, flour, evaporated milk, sugar, lemon peel, vanilla extract and salt in blender; cover. Blend until smooth. Scrape down sides and blend again if needed. Let mixture sit for approx. 10 min.",
            "Meanwhile, place an ovenproof frying pan in oven and preheat to 220°C/425°F. Remove frying pan from oven.",
            "Add butter to frying pan and swirl to coat all sides. Add batter to pan.",
            "Bake for 15 – 20 min. at 220°C/425°F, or until puffed and golden. Edges should be deep golden brown and crisp.",
            "Slide Dutch baby onto serving platter or cutting board, or serve straight from pan, if desired. Top with fresh berries and sprinkle with lemon juice. Dust with confectioner's sugar and cut into wedges for serving. Serve warm with maple syrup.",
            ""
        ],
        "steps_generated": [
            "A blender is filled with a mixture of eggs, flour, evaporated milk, sugar, lemon peel, vanilla extract, and salt",
            "A person is putting an ovenproof frying pan in an oven and preheating it to 220°C/425°F",
            "a person is adding batter to a frying pan that has butter in it",
            "a person is cooking a cake in an oven at 220°C/425°F",
            "A woman is cutting a Dutch baby into wedges on a cutting board with a knife",
            ""
        ],
        "goal": "Dutch baby"
    },
    "9": {
        "steps": [
            "Preheat the oven to 120°C/250°F. Heat (don't boil!) heavy cream with some of the sugar and vanilla seeds until the sugar has dissolved.",
            "Next, whisk the warm mixture into the egg yolks in a large bowl.",
            "Pour the mixture into brûlée tins and place these into a tall baking dish. Pour hot water into the baking dish, creating a water bath in which to cook the crème brûlée.",
            "Bake in a preheated oven at 120°C/250°F for approx. 60 min. Next, remove the tins from the water bath and leave to cool for 30 min. Chill for at least four hours or overnight before serving.",
            "Caramelize rest of the sugar in a small frying pan. Add a pinch of salt, pour in water and reduce into a sauce. Pour over the Crema Catalana to serve.",
            ""
        ],
        "steps_generated": [
            "a pot of heavy cream is being heated on a stove top",
            "the woman is whisking the mixture into the egg yolks in a large bowl",
            "A woman is pouring a mixture into brûlée tins and placing them into a tall baking dish. She then pours hot water into the baking dish, creating a water bath in which to cook the crème brûlée.",
            "A woman is baking a cake in a preheated oven at 120°C/250°F for about 60 minutes. After baking, she removes the tins from the water bath and leaves them to cool for 30 minutes before chilling for at least four hours or overnight before serving.",
            "A woman is pouring caramelized sugar into a small frying pan",
            ""
        ],
        "goal": "Crema Catalana with salted caramel sauce"
    },
    "10": {
        "steps": [
            "Preheat oven to 180°C/350°F. Grease and flour the cake pan. Line the bottom with parchment paper if it does not have a removable bottom. Zest all lemons and juice half of them. Set zest aside. In a medium bowl, combine flour, baking powder, and salt. In a measuring cup, mix together milk and lemon juice.",
            "Beat together butter, sugar, lemon zest, and some of the vanilla sugar until smooth. Add eggs one at a time, beating after each incorporation. Add half of the flour, mix to incorporate, then add the milk mixture and remaining flour. Stir until fully combined.",
            "Transfer batter to cake pan, smooth evenly, then bake at 180°C/350°F for approx. 20 – 30 min. Cool for approx. 10 min., then transfer to a wire rack to cool completely.",
            "Meanwhile, make frosting: Add crème fraîche, powdered sugar, and remaining vanilla sugar to a medium mixing bowl. Beat until combined and thickened slightly. Add a drop or two of food coloring until the desired shade of pink is reached. Stir until evenly incorporated.",
            "Smooth frosting over cake, decorate with sprinkles if desired, and",
            ""
        ],
        "steps_generated": [
            "A woman is pouring milk into a measuring cup to mix with lemon juice",
            "A woman is beating together butter, sugar, lemon zest, and some of the vanilla sugar until smooth. She then adds eggs one at a time, beating after each incorporation. She adds half of the flour, mixes to incorporate, then adds the milk mixture and remaining flour. Finally, she stirs until",
            "A woman is pouring batter into a cake pan and smoothing it evenly with a spatula",
            "A woman is adding crème fraîche, powdered sugar, and remaining vanilla sugar to a mixing bowl",
            "a woman is decorating a cake with sprinkles and frosting",
            ""
        ],
        "goal": "Tangy lemon sheet cake"
    },
    "13": {
        "steps": [
            "Finely chop rosemary. Combine buttermilk, lime zest, chopped rosemary, paprika, salt, and pepper. Add pressed garlic and stir to combine.",
            "Pour buttermilk mixture into a freezer bag. Add chicken wings and mix well. Transfer to refrigerator and let marinate for approx. 2 hours.",
            "Add bread crumbs to a large bowl. Coat chicken wings with bread crumbs, using tongs to make sure they are coated on all sides.",
            "Heat a generous amount of vegetable oil in a frying pan. Once oil is hot, add chicken wings and cook until browned and cooked through, approx. 8 – 10 min. Rotate to cook on all sides. Enjoy with your favorite dipping sauce.",
            "",
            ""
        ],
        "steps_generated": [
            "a person is chopping rosemary on a cutting board with a knife",
            "a person is pouring a liquid into a freezer bag that has chicken wings in it",
            "a person is adding bread crumbs to a large bowl with chicken wings in it",
            "A person is cooking chicken wings in a frying pan with vegetable oil",
            "",
            ""
        ],
        "goal": "Buttermilk chicken wings"
    }
}